import re

def validate_name(name):
    acceptable_characters = re.compile(r"^[A-Za-zÁáÀàÂâĂăÄäÅåÃãǍǎÆæÇçĆćĈĉĊċČčÐðÉéÈèÊêËëĚěĔĕĖėȨȩĘęẼẽĜĝĞğĠġĢģĤĥĦħÍíÌìÎîÏïĨĩĪīĬĭĮįĲĳĴĵĶķĹĺĻļĽľŁłḸḹḼḽŃńŇňÑñŅņǸǹŊŋÓóÒòÔôÖöÕõŐőǑǒØøǾǿŒœŔŕŘřŚśŜŝŞşŠšŢţŤťŦŧÚúÙùÛûÜüŨũŪūŬŭŮůŰűŲųẂẃẀẁŴŵÝýỲỳŶŷŸÿŹźŻżŽž]+(?:[ -][A-Za-zÁáÀàÂâĂăÄäÅåÃãǍǎÆæÇçĆćĈĉĊċČčÐðÉéÈèÊêËëĚěĔĕĖėȨȩĘęẼẽĜĝĞğĠġĢģĤĥĦħÍíÌìÎîÏïĨĩĪīĬĭĮįĲĳĴĵĶķĹĺĻļĽľŁłḸḹḼḽŃńŇňÑñŅņǸǹŊŋÓóÒòÔôÖöÕõŐőǑǒØøǾǿŒœŔŕŘřŚśŜŝŞşŠšŢţŤťŦŧÚúÙùÛûÜüŨũŪūŬŭŮůŰűŲųẂẃẀẁŴŵÝýỲỳŶŷŸÿŹźŻżŽž]+)*$")
    
    if not acceptable_characters.match(name):
        return False
    else:
        return True
    
print(validate_name("druloloy"))